# 一、Python数据类型包括字符串、整数、浮点数、布尔类型、空值类型、列表、字典等
# 数据类型之所以重要，因为它决定了你能在该类型的对象上运用哪些函数，函数是用来执行功能的
# 1.字符串str
# 表示文本内容，特点是会被单引号或双引号包裹。
# 1）用len函数对字符串求长度。
# 在字符串长度计算中，空格、数字和符号都会占据一个长度。
# *完整的转义符才占1个长度
s = "Hello World!"
print(len(s))

# 2）通过索引获取字符串中单个字符。
# 字符串后跟上方括号，方括号里放索引，就能提取出该索引位置的字符
# *索引是从0开始
print(s[11])
print(s[len(s)-1])

# 2.整数int,浮点数float

# 3.布尔类型bool
# 只包含两种值，True和False。*True和False首字母大写
b1 = True
b2 = False

# 4.空值类型NoneType
# 表示完全没有值。（如果你知道一个变量，但还不知道变量的值，可以先定义为none）*None首字母大写
n = None

# 二、type函数
# 会返回该对象的类型
print(type(s))
print(type(b1))
print(type(n))
print(type(1.5))
