# 30_文件路径
# 一、目录结构
# 1.类Unix操作系统(Linux, macOS等)
# 有根目录，用“/”表示
# 2.Windows操作系统
# 每个磁盘分区有自己的根目录，用“分区名:\”表示

# 二、定位文件位置
# 1.绝对路径
# 从根目录出发的路径
# 1）类Unix操作系统(Linux, macOS等)
# 绝对路径就是以斜杠开头，路径中的每个目录之间，用斜杠进行分隔，最后以目标文件或目标目录结尾
# 2）Windows操作系统
# 绝对路径以“分区名:\”开头，路径中的每个目录之间，用反斜杠进行分隔，最后以目标文件或目标目录结尾
# 2.相对路径
# 1）从一个参考位置出发，表示从一个参考位置出发，其它文件处于什么路径
# 2）用“.”来表示参照文件当前所在的目录，用“..”表示更上一层的父目录，用“../..”或"..\.."表示父目录的父目录
# 往更下层走的话，同样用"/"或"\"来分隔路径中的目录
# *"./"或".\"是可以省略的，所以同一目录下的文件，想互相用相对路径找到彼此的话，可以直接使用文件名
# 另：很多编辑器都能帮你复制文件的路径，比如：在PyCharm，右键点击文件，选择“复制路径/引用”
# 就可以获得那个文件的绝对路径，以及以最顶层项目目录为参考的相对路径
