# 2.4
# 一、Markdown
# (一)、优势
# 1.格式比纯文本更丰富
# 代码中的注释没法添加任何格式，或添加丰富的信息
# Markdown支持标题、粗体、引用、列表、代码块等常用格式
# 2.体积比富文本更轻量
# Word或者一些网站支持的富文本编辑器，可以让我们更改内容样式或排版。但它的功能过于强大多样，让产出文件更加臃肿
# 不支持自定义字体、颜色等操作，所有样式都是通过简单的符号来添加的。因此Markdown文件非常轻量，和纯文本差不了多少

# 代码包的README，文件后缀一般都是.md，说明是一个Markdown文件

# （二）、语法
# 1.标题
# 通过在前面添加1~6个#和1个空格，可以把文字设置成一至六级标题
# 2.加粗、斜体、删除样式
# 用两个*把文字包住，把文字变成粗体
# 用一个*把文字包住，把文字变成斜体
# 用两个~把文字包住，把文字用删除线划掉。*注意是英文输入法下的小波浪
# 3.普通文字
# 不把文字用任何符号包围的话，那就默认是普通的段落文字
# 特点：加的换行，只会在文字之间出现一个空格
# 如果想让文字分隔在不同行，一个方法是多打一次换行，另一个方法是在第一行后面额外加两个空格
# 4.列表
# 1）无序列表
# 在每个列表元素前面，加上短横杠、空格"- "
# 2）有序列表
# 在每个列表元素前面，加上数字、英文句号、空格"1. "
# 5.链接 *完整的链接是要带协议名的，比如前面的https://
# 1）展示链接
# 把链接直接像普通文字那样放进去，如果Markdown识别出来这是个链接，就会把它变成可跳转的
# 2）展示链接标题 更直观地告知读者链接指向的内容
# 方括号把链接包围起来，在后面紧跟着的括号里面，放上链接。
# [必应](https://cn.bing.com/)
# 6.图片
# 方括号里放文字，圆括号里面放图片链接，同时在方括号前面加上一个英文感叹号
# ![城市景观](https://img0.baidu.com/it/u=25183460,870873689&fm=253)
# *插入图片，方括号里放文字的意义是，如果图片加载不出来的话，就会显示那个文字内容作为替代
# 7.引用
# 插入一个引用段落，用右书名号、空格，后面紧跟着引用内容
# 引用段落里的文字，和普通段落里的文字一样，不会因为你在内容里加了换行，展示效果里就有换行
"""
>蒹葭苍苍
白露为霜
"""
# 8.代码
# 1）要在文字里插入代码，就用反引号包裹住代码，`import math`
# 2）如果我们要插入独占一段的代码段落，就用三个反引号包裹住代码段落
# *在开头的三个反引号后面，还可以跟上代码语言的名字，这样Markdown就会展示针对那个语言的语法高亮
"""
```python
import math
print("Hello World!")
print(math.pi)
```
"""
# 9.公式
# 1）在行内插入公式，就用1个$，包裹住那个公式
# 2）要插入一个独占一行的公式，就用2个$，包裹住那个公式
# 3）复杂的公式，可以用LaTex语法来表示

# 二、LaTex
# LaTex是一个排版系统，可以负责定义书籍、简历、论文等格式和布局，不局限于数学公式
# 在JN的使用场景里，用LaTex就是为了在Markdown里插入公式，所以只需学会公式相关语法即可
# 1.加减乘除
# 表示加减的符号，就是键盘上的加减
# 乘号和除号是没有的，用\times表示乘号，\div表示除号
"""
$$x + y$$
$$x - y$$
$$x \times y$$
$$x \div y$$
"""
# 2.上标下标
# 要加上标，用插入符^，跟上作为上标的内容；要加下标，用下划线_，后面跟上作为下标的内容
# *LaTex默认上标或下标只包含1位字符，如果想把多个字符作为上标或下标，用花括号把它们组合起来，就可以了
"""
$$x^3$$
$$H_2O$$ 
$$S_{input}$$
"""
# 3.求和求根
# 求根符号，\sqrt，后面可以跟上方括号，里面的数字表示求几次方根
# *LaTex默认求根符号的横线只拉到第1个字符，如果对一个长公式求根，可以在方括号后面跟上花括号，把要求根的内容全部包围起来
"""
$$\sum(x^2 + y^2)$$
$$\sqrt[3]x$$
$$\sqrt[3]{a^2m^2}$$
"""
# 4.分数线
# 用\frac表示，后面跟着两个花括号，在第一个花括号里面，放分数线上面的内容；在第二个花括号里，放分数线下面的内容
"""
$$\frac{x+y}{x-y}$$
"""
# 5.其他
# 除上面之外，LaTex还能搞定其它无数的公式符号，
# 其他公式符号语法：https://oeis.org/wiki/List_of_LaTeX_mathematical_symbols
